Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/tc.h
#define TC_FMR_ENCF_Pos                       _UINT32_(0)                                          /* (TC_FMR Position) Enable Compare Fault Channel x */
#define TC_FMR_ENCF_Msk                       (_UINT32_(0x3) << TC_FMR_ENCF_Pos)                   /* (TC_FMR Mask) ENCF */
#define TC_FMR_ENCF(value)                    (TC_FMR_ENCF_Msk & (_UINT32_(value) << TC_FMR_ENCF_Pos)) 

/* -------- TC_QSR : (TC Offset: 0xDC) ( R/ 32) QDEC Status Register -------- */
#define TC_QSR_DIR_Pos                        _UINT32_(8)                                          /* (TC_QSR) Direction Position */
#define TC_QSR_DIR_Msk                        (_UINT32_(0x1) << TC_QSR_DIR_Pos)                    /* (TC_QSR) Direction Mask */
#define TC_QSR_DIR(value)                     (TC_QSR_DIR_Msk & (_UINT32_(value) << TC_QSR_DIR_Pos)) /* Assigment of value for DIR in the TC_QSR register */
#define TC_QSR_Msk                            _UINT32_(0x00000100)                                 /* (TC_QSR) Register Mask  */


/* -------- TC_WPMR : (TC Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define TC_WPMR_WPEN_Pos                      _UINT32_(0)                                          /* (TC_WPMR) Write Protection Enable Position */
#define TC_WPMR_WPEN_Msk                      (_UINT32_(0x1) << TC_WPMR_WPEN_Pos)                  /* (TC_WPMR) Write Protection Enable Mask */
#define TC_WPMR_WPEN(value)                   (TC_WPMR_WPEN_Msk & (_UINT32_(value) << TC_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the TC_WPMR register */
#define TC_WPMR_WPITEN_Pos                    _UINT32_(1)                                          /* (TC_WPMR) Write Protection Interrupt Enable Position */
#define TC_WPMR_WPITEN_Msk                    (_UINT32_(0x1) << TC_WPMR_WPITEN_Pos)                /* (TC_WPMR) Write Protection Interrupt Enable Mask */
#define TC_WPMR_WPITEN(value)                 (TC_WPMR_WPITEN_Msk & (_UINT32_(value) << TC_WPMR_WPITEN_Pos)) /* Assigment of value for WPITEN in the TC_WPMR register */
#define TC_WPMR_WPCREN_Pos                    _UINT32_(2)                                          /* (TC_WPMR) Write Protection Control Enable Position */
#define TC_WPMR_WPCREN_Msk                    (_UINT32_(0x1) << TC_WPMR_WPCREN_Pos)                /* (TC_WPMR) Write Protection Control Enable Mask */
#define TC_WPMR_WPCREN(value)                 (TC_WPMR_WPCREN_Msk & (_UINT32_(value) << TC_WPMR_WPCREN_Pos)) /* Assigment of value for WPCREN in the TC_WPMR register */
#define TC_WPMR_FIRSTE_Pos                    _UINT32_(4)                                          /* (TC_WPMR) First Error Report Enable Position */
#define TC_WPMR_FIRSTE_Msk                    (_UINT32_(0x1) << TC_WPMR_FIRSTE_Pos)                /* (TC_WPMR) First Error Report Enable Mask */
#define TC_WPMR_FIRSTE(value)                 (TC_WPMR_FIRSTE_Msk & (_UINT32_(value) << TC_WPMR_FIRSTE_Pos)) /* Assigment of value for FIRSTE in the TC_WPMR register */
#define TC_WPMR_WPKEY_Pos                     _UINT32_(8)                                          /* (TC_WPMR) Write Protection Key Position */
#define TC_WPMR_WPKEY_Msk                     (_UINT32_(0xFFFFFF) << TC_WPMR_WPKEY_Pos)            /* (TC_WPMR) Write Protection Key Mask */
#define TC_WPMR_WPKEY(value)                  (TC_WPMR_WPKEY_Msk & (_UINT32_(value) << TC_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the TC_WPMR register */
#define   TC_WPMR_WPKEY_PASSWD_Val            _UINT32_(0x54494D)                                   /* (TC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define TC_WPMR_WPKEY_PASSWD                  (TC_WPMR_WPKEY_PASSWD_Val << TC_WPMR_WPKEY_Pos)      /* (TC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position  */
#define TC_WPMR_Msk                           _UINT32_(0xFFFFFF17)                                 /* (TC_WPMR) Register Mask  */


/* -------- TC_RPR : (TC Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#define TC_RPR_RXPTR_Pos                      _UINT32_(0)                                          /* (TC_RPR) Receive Pointer Register Position */
#define TC_RPR_RXPTR_Msk                      (_UINT32_(0xFFFFFFFF) << TC_RPR_RXPTR_Pos)           /* (TC_RPR) Receive Pointer Register Mask */
#define TC_RPR_RXPTR(value)                   (TC_RPR_RXPTR_Msk & (_UINT32_(value) << TC_RPR_RXPTR_Pos)) /* Assigment of value for RXPTR in the TC_RPR register */
#define TC_RPR_Msk                            _UINT32_(0xFFFFFFFF)                                 /* (TC_RPR) Register Mask  */


/* -------- TC_RCR : (TC Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#define TC_RCR_RXCTR_Pos                      _UINT32_(0)                                          /* (TC_RCR) Receive Counter Register Position */
#define TC_RCR_RXCTR_Msk                      (_UINT32_(0xFFFF) << TC_RCR_RXCTR_Pos)               /* (TC_RCR) Receive Counter Register Mask */
#define TC_RCR_RXCTR(value)                   (TC_RCR_RXCTR_Msk & (_UINT32_(value) << TC_RCR_RXCTR_Pos)) /* Assigment of value for RXCTR in the TC_RCR register */
#define TC_RCR_Msk                            _UINT32_(0x0000FFFF)                                 /* (TC_RCR) Register Mask  */


/* -------- TC_RNPR : (TC Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#define TC_RNPR_RXNPTR_Pos                    _UINT32_(0)                                          /* (TC_RNPR) Receive Next Pointer Position */
#define TC_RNPR_RXNPTR_Msk                    (_UINT32_(0xFFFFFFFF) << TC_RNPR_RXNPTR_Pos)         /* (TC_RNPR) Receive Next Pointer Mask */
#define TC_RNPR_RXNPTR(value)                 (TC_RNPR_RXNPTR_Msk & (_UINT32_(value) << TC_RNPR_RXNPTR_Pos)) /* Assigment of value for RXNPTR in the TC_RNPR register */
#define TC_RNPR_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (TC_RNPR) Register Mask  */


/* -------- TC_RNCR : (TC Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#define TC_RNCR_RXNCTR_Pos                    _UINT32_(0)                                          /* (TC_RNCR) Receive Next Counter Position */
#define TC_RNCR_RXNCTR_Msk                    (_UINT32_(0xFFFF) << TC_RNCR_RXNCTR_Pos)             /* (TC_RNCR) Receive Next Counter Mask */
#define TC_RNCR_RXNCTR(value)                 (TC_RNCR_RXNCTR_Msk & (_UINT32_(value) << TC_RNCR_RXNCTR_Pos)) /* Assigment of value for RXNCTR in the TC_RNCR register */
#define TC_RNCR_Msk                           _UINT32_(0x0000FFFF)                                 /* (TC_RNCR) Register Mask  */


